def количество_кроликов(n, m):
    кролики = [0] * (n + 1)
    кролики[1] = 1
    for месяц in range(2,n+1):
        if месяц <= m:
            кролики[месяц] = кролики[месяц - 1] + кролики[месяц - 2]
        else:
            кролики[месяц] = кролики[месяц - 1] + кролики[месяц - 2] - кролики[месяц - m - 1]
    return кролики[n]
n = int(input("Введите число месяцев (n): "))
m = int(input("Введите срок жизни кроликов в месяцах (m): "))
результат = количество_кроликов(n,m)
print(f"Количество пар кроликов на {n}-й месяц: {результат}")

