Лабораторная работа 2. Работа с файлами в Python. 
Вариант 4. Вычисление массы протеинов.
ЦЕЛЬ: Вычислить массу белка на основе заданной последовательности аминокислот, используя их моноизотопные массы.
ЗАДАЧА: 1. Создать таблицу соответствия аминокислот и их моноизотопных масс.
        2. Реализовать алгоритм вычисления веса строки на основе данных из таблицы.
        3. Проверить корректность работы программы на примере.
        4. Вывести итоговый вес последовательности.
ХОД РАБОТЫ. Разберём мой код:
1. Создание словаря masses. В словаре хранятся массы аминокислот (в дальтонах). Каждая аминокислота (символ) сопоставлена с её массой.
2. Определение массы воды (water_mass). Учитывается масса молекулы воды (18.01056 Da), которая участвует в процессе образования пептидных связей между аминокислотами.
3. Ввод данных (sequence = input(...))

Пользователь вводит последовательность аминокислот.

Программа считывает строку sequence.

4. Вычисление массы белка (sequence_mass)

sum(masses[aa] for aa in sequence): суммируется масса всех аминокислот в последовательности.

sequence_mass -= len(sequence) * water_mass: отнимаем массу воды за каждую аминокислоту.

sequence_mass += water_mass: добавление одной молекулы воды, чтобы сохранить правильный биохимический расчет.

5. Вывод результата (print(...))
Вычисленная масса белка выводится с точностью до трех знаков после запятой.
ВЫВОДЫ: Программа успешно вычисляет вес заданной последовательности. Реализация алгоритма позволяет легко расширять функциональность, например, добавляя поддержку дополнительных биохимических расчетов.
Полученный результат может быть использован в биоинформатике для анализа состава белков.
